[
  {
    "id": 1,
    "title": "A Day in the Life of a Computer Science Student",
    "date": "13 August 2024",
    "image": "https://images.unsplash.com/photo-1499750310107-5fef28a66643?q=80&w=1770&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
    "description": "Today was all about debugging my code and solving challenging problems in algorithms class. I started the day with a morning lecture, followed by a lab session where we worked on a complex coding assignment. The afternoon was spent debugging some issues in my code that had been bothering me for days. By the evening, I felt a sense of accomplishment as I finally solved the problem and submitted the assignment on time. It's days like these that remind me why I love studying computer science. Even though it's tough, the satisfaction of overcoming challenges makes it all worthwhile.",
    "like": 30
  },
  {
    "id": 2,
    "title": "How I Stay on Top of My Studies",
    "date": "12 August 2024",
    "image": "https://images.unsplash.com/photo-1456513080510-7bf3a84b82f8?q=80&w=1973&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
    "description": "Staying organized is key to managing the workload of a computer science student. I rely heavily on my planner to keep track of deadlines, class schedules, and study sessions. I also make sure to break down larger projects into smaller tasks that are easier to manage. This approach helps me stay on top of my coursework without feeling overwhelmed. In addition to staying organized, I also make time for regular breaks and self-care. This helps me stay focused and productive without burning out.",
    "like": 34
  },
  {
    "id": 3,
    "title": "Balancing Studies and Social Life",
    "date": "10 August 2024",
    "image": "https://images.unsplash.com/photo-1604882406305-67a5b1376126?q=80&w=1887&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
    "description": "Finding the right balance between studies and hanging out with friends can be tricky, but here’s how I manage. I make sure to prioritize my assignments and study time, but I also set aside time each week to unwind and socialize with friends. Whether it's grabbing coffee, going for a walk, or just hanging out in the dorm, spending time with friends helps me recharge and stay motivated. It's all about finding a balance that works for you and being mindful of your time management.",
    "like": 15
  },
  {
    "id": 4,
    "title": "My First Hackathon Experience",
    "date": "9 August 2024",
    "image": "https://images.unsplash.com/photo-1499914485622-a88fac536970?q=80&w=1770&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
    "description": "Participating in my first hackathon was both exhilarating and exhausting. We worked tirelessly to create a working prototype of our idea within 24 hours. The experience taught me a lot about teamwork, time management, and problem-solving under pressure. Although we faced several challenges along the way, the thrill of seeing our project come to life made it all worthwhile. It was a memorable experience that has fueled my passion for coding and innovation.",
    "like": 27
  },
  {
    "id": 5,
    "title": "Tips for Surviving Exam Season",
    "date": "8 August 2024",
    "image": "https://images.unsplash.com/photo-1606326608606-aa0b62935f2b?q=80&w=1770&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
    "description": "Exam season is here, and it's time to buckle down. My strategies for staying focused include creating a study schedule, taking regular breaks, and making sure to get enough sleep. I also make use of past papers and study groups to reinforce my understanding of key concepts. It’s important to stay calm and not let stress get the best of you. With the right approach, you can ace your exams without burning out.",
    "like": 45
  },
  {
    "id": 6,
    "title": "Why I Love Learning Python",
    "date": "7 August 2024",
    "image": "https://images.unsplash.com/photo-1487058792275-0ad4aaf24ca7?q=80&w=1840&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
    "description": "Python has become one of my favorite programming languages. It’s powerful yet simple, making it ideal for beginners and experts alike. The versatility of Python allows me to work on a wide range of projects, from web development to data analysis. I also love the large community of Python developers who are always willing to help and share their knowledge. Python has opened up so many opportunities for me, and I’m excited to continue learning and growing my skills.",
    "like": 22
  },
  {
    "id": 7,
    "title": "Overcoming Imposter Syndrome",
    "date": "6 August 2024",
    "image": "https://images.unsplash.com/photo-1723754165998-305df32c501e?q=80&w=1770&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
    "description": "Imposter syndrome can be tough to deal with, especially in a competitive field like computer science. I've found that focusing on my accomplishments, seeking feedback from peers, and setting realistic goals helps me build confidence in my abilities. It's important to remember that everyone experiences self-doubt at times, but it doesn’t define your worth or potential. By taking small steps to overcome imposter syndrome, I’ve been able to grow both personally and professionally.",
    "like": 31
  },
  {
    "id": 8,
    "title": "The Importance of Networking in Tech",
    "date": "5 August 2024",
    "image": "https://images.unsplash.com/photo-1550177977-ad69e8f3cae0?q=80&w=1770&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
    "description": "Networking has opened up so many opportunities for me in the tech industry. Building a strong professional network has helped me connect with mentors, learn about job opportunities, and stay updated on industry trends. Whether it’s attending conferences, joining online communities, or simply reaching out to someone on LinkedIn, networking is a powerful tool that can help you advance your career. It's something I highly recommend to anyone looking to grow in the tech field.",
    "like": 29
  },
  {
    "id": 9,
    "title": "Building My First Web App",
    "date": "4 August 2024",
    "image": "https://images.unsplash.com/photo-1487058792275-0ad4aaf24ca7?q=80&w=1840&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
    "description": "Creating my first web app was a challenging yet rewarding experience. I learned a lot about coding, debugging, and deployment. The process taught me the importance of patience, perseverance, and attention to detail. It was amazing to see my idea come to life and to receive positive feedback from users. This project has inspired me to continue building and improving my skills in web development.",
    "like": 24
  },
  {
    "id": 10,
    "title": "The Power of Open Source",
    "date": "3 August 2024",
    "image": "https://images.unsplash.com/photo-1535930749574-1399327ce78f?q=80&w=1850&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
    "description": "Contributing to open source projects has been one of the most fulfilling aspects of my journey as a developer. Open source allows you to collaborate with developers from around the world, learn new skills, and make a positive impact on the community. It's a great way to give back and help improve the tools and technologies that we all rely on. I encourage everyone, regardless of experience level, to get involved in open source. It's a powerful way to learn, grow, and connect with others in the tech community.",
    "like": 20
  }
]
